/**
 * Created by Anton on 03.12.14.
 */


var check1 = false;
var check3 = false;
var check4 = false;
var check5 = false;
var check6 = false;
var check7 = 0;
var check8 = false;
var check9 = true;
var check12 = false;
var check13 = false;
var check14 = false;


$(function () {

    jQuery.validator.addMethod("pattern", function (value, element, param) {
        if (this.optional(element)) {
            return true;
        }
        if (typeof param === "string") {
            param = new RegExp(param);
        }
        return param.test(value);
    }, "Неверный формат");


    jQuery.validator.addMethod("phone", function (value) {
        return /\+?(7|8)\d{10}/.test(value);
    }, 'Неверный формат телефона');


    jQuery.validator.addMethod("customDate", function (value, element) {
        if (this.optional(element)) {
            return true;
        }

        return /\d{2}\/\d{2}\/\d{4}/.test(value);
    }, 'Неверный формат телефона');


    var $shopSelect = $('#magazine'),
        $citySelect = $('#city'),
        $form = $('#reg_card'),
        $formConfirm = $('#reg_confirm');

    $.each(magg, function (index, item) {
        $shopSelect.append($('<option></option>', {value: item, text: item}));
    });

    /**/

    //  $shopSelect.selectbox('detach').selectbox('attach');


    $form.validate({
        errorElement: 'p',
        rules: {
            dc: {
                required: true,
                pattern: '[0-9]{13,16}'
            },
            fn: 'required',
            region_id: 'required',
            sn: 'required',
            tn: 'required',
            sex: 'required',
			ns: 'required',
			nmag: 'required',
            sl: 'required',
            dd: {
                customDate: true
            },            
            phone: {
                required: true
            },
            email: {
                required: true,
                email: true
            }
        },
        errorPlacement: function(){
            return false;
        },
        submitHandler: function (form) {
            if (check1 == true && check3 == true && check6 == true && check4 == true && check5 == true && check7 == true && check9 == true && check12 == true && check13 == true && check14 == true) {
                var data = $(form).serialize();
                $.post('sms.php?get_sms=1&' + $('#reg_card').serialize(), data, function (json) {
                    
                    if (json.success) {

                        // $('#Confirm_hashkey').val(json.hashkey);
                    
                        $form.slideUp();
						$('.checksotr').slideUp();
                        $formConfirm.slideDown(400, function () {
                            $('#Confirm_promokey').focus();
                        });

                    } else {
                        //console.log(json.errors);

                        if (json.errors.dc != undefined) {
                            var $input = $(form).find('[name=dc]'),
                                $dcError = $input.next('div.error');

                            if ($dcError.length > 0)
                                $dcError.remove();

                            $input.removeClass('valid').addClass('error');

                            $input.after('<div class="error">Неверный номер карты</div>');
                            $input.focus();

                        }

                    }

                }, 'json');
            }
        }
    });

    $formConfirm.validate({
        errorElement: 'p',
        rules: {
            promokey: 'required'
        },
        submitHandler: function (form) {
            dataLayer.push({"event": "reg_bonus_success"});
            
            var data = $(form).serialize();
            $('#reg_confirm input[type="submit"]').fadeOut();

            $.post('sms.php?check_sms=1&code=' + $('#Confirm_promokey').val(), data, function (json) {                
               
                if (json.success) {
                    $.post('sent_to_db.php?' + $('#reg_card').serialize() + '&active=yes', data, function (ans) {
                        try {
                            var oResp = $.parseJSON(ans);
                            if (oResp.result == 'success') {
                                $formConfirm.html($('<h3></h3>', {
                                    text: 'Благодарим Вас за регистрацию в Бонусной программе лояльности.',
                                    'class': 'text-success'
                                }));
                                //dataLayer.push({"event":"reg_bonus_success"});

                                $("#coc").attr("disabled", "disabled");
                                setTimeout('$("#coc").removeAttr("disabled");', 7000);
                            } else {
                                var errorMsg = "При регистрации карты произошла ошибка. ";
                                if (oResp.details) {
                                    errorMsg += oResp.details.RMessage;                                    
                                }
                                $formConfirm.html($('<h3></h3>', {
                                    text: errorMsg,
                                    'class': 'text-error'
                                }));
                            }
                        } catch (e) {
                            $formConfirm.html($('<h3></h3>', {
                                text: 'При регистрации карты произошла ошибка.',
                                'class': 'text-error'
                            }));
                        }
 
                    });
                    
                } else {
                    $('input[name="promokey"]').addClass('error');
                    $('#reg_confirm input[type="submit"]').fadeIn();
                }
            }, 'json');
        }
    });

    $('#agree').change(function () {
        if ($(this).prop('checked')) {
            $('#coc').show();
        } else {
            $('#coc').hide();
        }
    });


    $('.options li').click(function () {

    });


    $('#toggleAddi').click(function () {
        var $addi = $('#addi');

        if ($addi.is(':visible')) {
            $addi.hide();
        } else {
            $addi.show();
        }
    });

// ecom-1143, 
// на лпаншетах не получалось
// вбить телефонный номер
// из-за форматирования

/*if(screen.width>500)
{
    $('#phone').inputmask("+7(999)999-99-99");
}
else{
    $('#phone').inputmask("+7(999)999-99-99");
}*/

});


var magg = [],
    maggs = 262;

magg[0] = "Азов, Ленина ул., д. 72";
magg[1] = "Альметьевск, Герцена ул., д. 3В";
magg[2] = "Анапа, Красноармейская ул., д. 17";
magg[3] = "Апатиты, Ферсмана ул., д. 23";
magg[4] = "Армавир, Мира ул., д. 51";
magg[5] = "Архангельск, Воскресенская ул., д. 101";
magg[6] = "Архангельск, Попова ул., д.16";
magg[7] = "Архангельск, Троицкий пр., д. 20";
magg[8] = "Астрахань, Кирова ул., д. 7";
magg[9] = "Барнаул, Космонавтов ул., д. 6В";
magg[10] = "Барнаул, Ленина ул., д. 24";
magg[11] = "Барнаул, Ленина ул., д. 73";
magg[12] = "Березники, Мира ул., д. 82";
magg[13] = "Березники, Пятилетки ул., д. 42";
magg[14] = "Боровичи, Подбельского ул., д. 17Б";
magg[15] = "Брянск, 3-го Интернационала ул., д. 4";
magg[16] = "Брянск, Красноармейская ул., д. 62/1";
magg[17] = "Брянск, Союзная ул., д. 5";
magg[18] = "Великие Луки, Ленина ул., д. 48";
magg[19] = "Великий Новгород, Б. С-Петербургская ул., д. 34";
magg[20] = "Великий Новгород, Свободы ул., д.14";
magg[21] = "Видное, Ленинского Комсомола пр., д. 46а";
magg[22] = "Владимир, Гагарина ул., д. 5";
magg[23] = "Владимир, Тракторная ул., д. 45";
magg[24] = "Владимир, Тракторная ул., д. 48";
magg[25] = "Волгоград, Качинцев ул., д. 87";
magg[26] = "Волгоград, Маршала Еременко ул., д. 130";
magg[27] = "Волгоград, Ополченская ул., д. 14";
magg[28] = "Волгоград, Университетский пр., д. 25";
magg[29] = "Волжский, Мира ул., д. 47В";
magg[30] = "Волжский, Мира ул., д. 62";
magg[31] = "Вологда, Мира ул., д. 20";
magg[32] = "Вологда, Мира ул., д. 42";
magg[33] = "Воркута, Ленина ул., д. 36";
magg[34] = "Воскресенск, Менделеева ул., д. 20";
magg[35] = "Выборг, Ленина ул., д. 20";
magg[36] = "Вышний Волочек, Казанский пр., д. 64а";
magg[37] = "Гатчина, Генерала Кныша ул., д. 21";
magg[38] = "Гатчина, Соборная ул., д. 9";
magg[39] = "Екатеринбург, 8 марта ул., д. 150";
magg[40] = "Екатеринбург, Баумана ул., д. 1";
magg[41] = "Екатеринбург, Белореченская ул., д. 17/1";
magg[42] = "Екатеринбург, Блюхера ул., д. 39";
magg[43] = "Екатеринбург, Вайнера ул., д. 9а";
magg[44] = "Екатеринбург, Грибоедова ул., д. 20";
magg[45] = "Екатеринбург, Грибоедова ул., д. 26";
magg[46] = "Екатеринбург, Дуб. Сибирского тракта ул., д. 2";
magg[47] = "Екатеринбург, Космонавтов ул., д. 45";
magg[48] = "Екатеринбург, Ленина пр., д. 95";
magg[49] = "Екатеринбург, Свердлова ул., д. 60";
magg[50] = "Екатеринбург, Ст. Большевивков ул., д. 86";
magg[51] = "Екатеринбург, Театральный пер., д. 7";
magg[52] = "Екатеринбург, Челюскинцев ул., д. 21";
magg[53] = "Екатеринбург, Шварца ул., д. 17";
magg[54] = "Екатеринбург, Щорса 29";
magg[55] = "Екатеринбург, Щорса ул., д. 54";
magg[56] = "Екатеринбург, Ясная ул., д. 2";
magg[57] = "Иваново, Куконковых ул., д. 141";
magg[58] = "Иваново, Лежневская ул., д. 142";
magg[59] = "Иваново, Ленина пр., д. 47";
magg[60] = "Иваново, Ленина пр., д. 7";
magg[61] = "Ишимбай, Ленина пр., д. 40";
magg[62] = "Йошкар-Ола, Чайваны ул., д. 41";
magg[63] = "Казань, Амирхана Еники ул., д. 1/51";
magg[64] = "Казань, Баумана ул., д. 76";
magg[65] = "Казань, Декабристов ул., д. 187";
magg[66] = "Казань, Зорге ул., д. 95";
magg[67] = "Казань, М. Межлаука ул., д. 16/21";
magg[68] = "Казань, Сибирский тракт, д. 11";
magg[69] = "Казань, Шахиди ул., д. 1/15";
magg[70] = "Калининград, Баранова пр., д. 34";
magg[71] = "Калининград, Ленинский пр., д. 34а";
magg[72] = "Калининград, Ленинский пр., д. 53";
magg[73] = "Калуга, Кирова ул., д. 1";
magg[74] = "Калуга, Кирова ул., д. 16";
magg[75] = "Калуга, Кирова ул., д. 32";
magg[76] = "Каменск-Уральский, Суворова ул., д. 23а";
magg[77] = "Кандалакша, Первомайская ул., д. 59";
magg[78] = "Кемерово, Ленина ул., д. 133";
magg[79] = "Кемерово, Ленина ул., д. 35";
magg[80] = "Кемерово, Советский ул., д. 44";
magg[81] = "Кемерово, Шахтеров ул., д. 54";
magg[82] = "Кингисепп, К. Маркса пр., д. 33";
magg[83] = "Киров, Воровского ул., д. 137";
magg[84] = "Киров, Комсомольская ул., д. 23";
magg[85] = "Колпино, Пролетарская ул., д. 15";
magg[86] = "Колпино, Пролетарская ул., д. 38";
magg[87] = "Колпино, Тазаева ул., д. 5";
magg[88] = "Копейск, Славы пр., д. 1";
magg[89] = "Кострома, Подлипаева ул., д. 3";
magg[90] = "Краснодар, В. Головатого ул., д. 313 (2 этаж) SF";
magg[91] = "Краснодар, Ставропольская ул., д. 65";
magg[92] = "Краснодар, ул. Уральского, д. 102";
magg[93] = "Красное село, Ленина пр., д. 61/2";
magg[94] = "Краснотурьинск, Ленина ул., д. 42";
magg[95] = "Красноярск, Мира ул., д. 96";
magg[96] = "Кронштадт, Ленина ул., д. 16";
magg[97] = "Мелеуз, Ленина ул., д. 133";
magg[98] = "Мончегорск, Металлургов пр., д. 34а";
magg[99] = "Москва, Локомотивный проезд, д. 4";
magg[100] = "Мурманск, Коминтерна ул., д. 11";
magg[101] = "Мурманск, Коминтерна ул., д. 9/1";
magg[102] = "Мурманск, Ленина пр., д. 19а";
magg[103] = "Мурманск, Ленина ул., д. 68";
magg[104] = "Набережные Челны, Мира ул., д. 3";
magg[105] = "Набережные Челны, Московский пр., д. 128";
magg[106] = "Набережные Челны, Энтузиастов пр., д. 16";
magg[107] = "Нальчик, Ленина ул., д. 20";
magg[108] = "Нижний Новгород, Дьяконова ул., д. 23";
magg[109] = "Нижний Новгород, Родионова ул., д. 187";
magg[110] = "Нижний Тагил, Вагоностроителей ул., д. 21";
magg[111] = "Нижний Тагил, Ленина ул., д. 52";
magg[112] = "Новосибирск, Гоголя ул., д. 9";
magg[113] = "Новосибирск, Карла Маркса ул., д. 3";
magg[114] = "Новосибирск, Красный пр., д. 186";
magg[115] = "Новосибирск, Станиславского ул., д. 14";
magg[116] = "Новоуральск, Комсомольская ул., д.  2";
magg[117] = "Омск, Ленина ул, д. 19";
magg[118] = "Оренбург, Новая ул., д. 4";
magg[119] = "Оренбург, Советская ул., д. 40";
magg[120] = "Орехово-Зуево, Ленина ул., д. 14";
magg[121] = "Орск, Ленина ул., д. 24";
magg[122] = "Пенза, Кирова ул., д. 73";
magg[123] = "Пенза, Московская ул., д. 100";
magg[124] = "Пенза, Московская ул., д. 83";
magg[125] = "Пенза, Строителей пр., д. 45а";
magg[126] = "Пермь, Екатерининская ул., д. 114";
magg[127] = "Пермь, Комсомольский пр., д. 24";
magg[128] = "Пермь, Крупской ул., д. 25";
magg[129] = "Пермь, Маршала Рыбалко ул., д. 32";
magg[130] = "Пермь, Мира ул., д. 41";
magg[131] = "Пермь, Парковый пр., д. 48";
magg[132] = "Пермь, Петропавловская ул., д. 60/1";
magg[133] = "Петергоф, Санкт-Петербургский пр., д. 49";
magg[134] = "Петрозаводск, Ленина пр., д. 14";
magg[135] = "Петрозаводск, Ленина пр., д. 35";
magg[136] = "Петрозаводск, Маршала Мерецкого ул., д. 5";
magg[137] = "Печора, Гагарина ул., д. 39";
magg[138] = "Полярные Зори, Строителей ул., д. 4а";
magg[139] = "Псков, Октябрьский пр., д. 22";
magg[140] = "Псков, Рижский пр., д. 41";
magg[141] = "Псков, Юбилейная ул., д. 68";
magg[142] = "Реутов, Ленина ул., д. 4";
magg[143] = "Ростов-на-Дону, Б. Садовая ул., д. 76";
magg[144] = "Рыбинск, Бабушкина ул., д. 29 ТРК «Виконда»";
magg[145] = "Рыбинск, Герцена ул., д. 87";
magg[146] = "Рыбинск, Крестовая ул., д. 57";
magg[147] = "Рязань, Гагарина ул., д. 75";
magg[148] = "Рязань, Первомайский пр., д. 47";
magg[149] = "Рязань, Первомайский пр., д. 7";
magg[150] = "Самара, 4 проезд, д. 57";
magg[151] = "Самара, Авроры ул., д. 92а ";
magg[152] = "Самара, Гагарина ул., д. 49";
magg[153] = "Самара, Ленинградская ул., д. 27";
magg[154] = "Самара, Металлургов пр., д. 80";
magg[155] = "Самара, Победы ул., д. 123";
magg[156] = "Самара, Спортивная ул., д. 11а";
magg[157] = "Саранск, Гагарина ул., д. 99";
magg[158] = "Саранск, Ленина пр., д. 3";
magg[159] = "Северодвинск, Ломоносова ул., д. 81";
magg[160] = "Североморск, Сафонова ул., д. 17";
magg[161] = "Сергиев Посад, Рыбная ул., д. 19";
magg[162] = "Смоленск, Колхозная пл., д. 1";
magg[163] = "СПБ, 1-ая Красноармейская ул., д. 1";
magg[164] = "СПБ, Б. Московская ул., д. 1-3/2";
magg[165] = "СПБ, Бабушкина ул., д. 71/8";
magg[166] = "СПБ, Балканская ул., д. 5 ЖД Купчино";
magg[167] = "СПБ, Белы Куна ул., д. 8";
magg[168] = "СПБ, Большевиков пр., д. 1";
magg[169] = "СПБ, Будапештская ул., д. 46";
magg[170] = "СПБ, Ветеранов пр., д. 97";
magg[171] = "СПБ, Гороховая ул., д. 41";
magg[172] = "СПБ, Гражданский пр., д.  68";
magg[173] = "СПБ, Гражданский пр., д. 114";
magg[174] = "СПБ, Гражданский пр., д. 114 (ближе к метро)";
magg[175] = "СПБ, Дыбенко ул., д. 27/1";
magg[176] = "СПБ, Елизарова ул., д. 12";
magg[177] = "СПБ, Ефимова ул., д. 1/4";
magg[178] = "СПБ, Ефимова ул., д. 3";
magg[179] = "СПБ, Заневский пр., д. 67";
magg[180] = "СПБ, Звездная ул., д. 8";
magg[181] = "СПБ, Индустриальный пр., д. 27";
magg[182] = "СПБ, Испытателей пр., д. 6";
magg[183] = "СПБ, Кантемировская ул., д. 27";
magg[184] = "СПБ, Караваевская ул., д. 24/1";
magg[185] = "СПБ, Кирочная ул., д. 19";
magg[186] = "СПБ, Коломяжский пр., д. 15";
magg[187] = "СПБ, Комендантский пр., д. 12";
magg[188] = "СПБ, Комсомола ул., д. 16а";
magg[189] = "СПб, Кондратьевский пр. 49";
magg[190] = "СПБ, Косыгина пр., д. 23";
magg[191] = "СПБ, Культуры пр., д. 1";
magg[192] = "СПБ, Ленинский пр., д. 128";
magg[193] = "СПБ, Ленсовета ул., д. 93/15";
magg[194] = "СПБ, Лиговский пр., д. 41/83";
magg[195] = "СПБ, Московский пр., д. 172";
magg[196] = "СПБ, Московский пр., д. 197";
magg[197] = "СПБ, Московский пр., д. 2";
magg[198] = "СПБ, Московский пр., д. 74";
magg[199] = "СПБ, Мучной пер., д. 9";
magg[200] = "СПБ, Наличная ул., д. 49";
magg[201] = "СПБ, Невский пр., д. 100";
magg[202] = "СПБ, Новаторов бул., д. 102";
magg[203] = "СПБ, Новаторов бул., д. 11";
magg[204] = "СПБ, Новаторов бул., д. 112";
magg[205] = "СПБ, Новочерскасский пр., д. 28/19";
magg[206] = "СПБ, Партизана Германа ул., д. 47";
magg[207] = "СПБ, Пражская ул., д. 48/50а";
magg[208] = "СПБ, Просвещения пр., д. 36";
magg[209] = "СПБ, Просвещения пр., д. 84";
magg[210] = "СПБ, Разъезжая ул., д. 43";
magg[211] = "СПБ, Стародеревенская ул., д. 36";
magg[212] = "СПБ, Стачек пр., д. 77";
magg[213] = "СПБ, Удельный пр., д. 25в";
magg[214] = "СПБ, Фучика ул., д. 2а";
/* magg[215]="СПБ, Энгельса пр., д. 111"; */
magg[216] = "СПБ, Энгельса пр., д. 111";
magg[217] = "СПБ, Энгельса пр., д. 138";
magg[218] = "Сыктывкар, Коммунистическая ул., д. 46";
magg[219] = "Сыктывкар, Коммунистическая ул., д. 46/1";
magg[220] = "Сыктывкар, Октябрьский пр., д.131/3";
magg[221] = "Тверь, Трехсвятская ул., д. 19";
magg[222] = "Тольятти, Борковская ул., д. 81";
magg[223] = "Тольятти, К. Маркса ул., д. 61";
magg[224] = "Томск, Нахимова ул., д. 15 ";
magg[225] = "Туймазы, Ленина пр., д. 2";
magg[226] = "Тюмень, Ленина пр., д. 71";
magg[227] = "Тюмень, Мельникайте ул., д. 101";
magg[228] = "Тюмень, Мельникайте ул., д. 126/3";
magg[229] = "Тюмень, Мельникайте ул., д. 64/3";
magg[230] = "Тюмень, Пермякова ул., д. 50а";
magg[231] = "Тюмень, Республики ул., д. 174/2";
magg[232] = "Тюмень, Республики ул., д. 200а";
magg[233] = "Тюмень, Республики ул., д. 86/3";
magg[234] = "Ульяновск, Генерала Тюленева ул., д. 3";
magg[235] = "Ульяновск, Гончарова ул, 38";
magg[236] = "Ульяновск, Гончарова ул., д. 24";
magg[237] = "Ульяновск, Рябикова ул., д. 60а";
magg[238] = "Ульяновск, Ульяновский пр., д. 14";
magg[239] = "Ульяновск, Ульяновский ул., д. 1";
magg[240] = "Усинск, Нефтяников ул., д. 50";
magg[241] = "Уфа, 50-летия Октября ул., д. 5";
magg[242] = "Уфа, Ахметова ул., д. 326/1";
magg[243] = "Уфа, Верхнеторговая пл., д. 1";
magg[244] = "Уфа, Комсомольская ул., д. 112 ТЦ ИЮНЬ";
magg[245] = "Уфа, Октября пр., д. 178";
magg[246] = "Уфа, Октября пр., д. 4";
magg[247] = "Уфа, Первомайская ул., д. 36";
magg[248] = "Ухта, Строительная ул., д. 2а  ";
magg[249] = "Чайковский, К. Маркса ул., д. 50";
magg[250] = "Чебоксары, Калинина ул., д. 105а";
magg[251] = "Чебоксары, Ленинградская ул., д. 27";
magg[252] = "Чебоксары, Привокзальная ул., д. 8";
magg[253] = "Челябинск, Воровского ул., д. 40";
magg[254] = "Челябинск, Дзержинского ул., д. 102";
magg[255] = "Челябинск, Комарова ул., д. 116";
magg[256] = "Челябинск, Ленина пр., д. 53";
magg[257] = "Череповец, Ленина ул., д. 88";
magg[258] = "Череповец, Ленинградская ул., д. 1";
magg[259] = "Череповец, Советский пр., д. 56";
magg[260] = "Черкесск, Ленина ул., д. 56";
magg[261] = "Чистополь, Ленина пр., д. 39д";
magg[262] = "Ярославль, Октября пр., д. 47";

var gorr = [];

gorr[0] = "Абаза";
gorr[1] = "Абакан";
gorr[2] = "Абдулино";
gorr[3] = "Абинск";
gorr[4] = "Агидель";
gorr[5] = "Агрыз";
gorr[6] = "Адыгейск";
gorr[7] = "Азнакаево";
gorr[8] = "Азов";
gorr[9] = "Ак-Довурак";
gorr[10] = "Аксай";
gorr[11] = "Алагир";
gorr[12] = "Алапаевск";
gorr[13] = "Алатырь";
gorr[14] = "Алдан";
gorr[15] = "Алейск";
gorr[16] = "Александров";
gorr[17] = "Александровск";
gorr[18] = "Александровск-Сахалинский";
gorr[19] = "Алексеевка";
gorr[20] = "Алексин";
gorr[21] = "Алзамай";
gorr[22] = "Альметьевск";
gorr[23] = "Амурск";
gorr[24] = "Анадырь";
gorr[25] = "Анапа";
gorr[26] = "Ангарск";
gorr[27] = "Андреаполь";
gorr[28] = "Анжеро-Судженск";
gorr[29] = "Анива";
gorr[30] = "Апатиты";
gorr[31] = "Апрелевка";
gorr[32] = "Апшеронск";
gorr[33] = "Арамиль";
gorr[34] = "Аргун";
gorr[35] = "Ардатов";
gorr[36] = "Ардон";
gorr[37] = "Арзамас";
gorr[38] = "Арзамас";
gorr[39] = "Аркадак";
gorr[40] = "Армавир";
gorr[41] = "Арсеньев";
gorr[42] = "Артём";
gorr[43] = "Артёмовск";
gorr[44] = "Артёмовский";
gorr[45] = "Архангельск";
gorr[46] = "Асбест";
gorr[47] = "Асино";
gorr[48] = "Астрахань";
gorr[49] = "Аткарск";
gorr[50] = "Ахтубинск";
gorr[51] = "Ачинск";
gorr[52] = "Аша";
gorr[53] = "Бабаево";
gorr[54] = "Бабушкин";
gorr[55] = "Бавлы";
gorr[56] = "Багратионовск";
gorr[57] = "Байкальск";
gorr[58] = "Баймак";
gorr[59] = "Бакал";
gorr[60] = "Баксан";
gorr[61] = "Балабаново";
gorr[62] = "Балаково";
gorr[63] = "Балахна";
gorr[64] = "Балахна";
gorr[65] = "Балашиха";
gorr[66] = "Балашов";
gorr[67] = "Балей";
gorr[68] = "Балтийск";
gorr[69] = "Барабинск";
gorr[70] = "Барнаул";
gorr[71] = "Барыш";
gorr[72] = "Батайск";
gorr[73] = "Бежецк";
gorr[74] = "Белая Калитва";
gorr[75] = "Белая Холуница";
gorr[76] = "Белгород";
gorr[77] = "Белебей";
gorr[78] = "Белёв";
gorr[79] = "Белинский";
gorr[80] = "Белово";
gorr[81] = "Белогорск";
gorr[82] = "Белозерск";
gorr[83] = "Белокуриха";
gorr[84] = "Беломорск";
gorr[85] = "Белорецк";
gorr[86] = "Белореченск";
gorr[87] = "Белоусово";
gorr[88] = "Белоярский";
gorr[89] = "Белый";
gorr[90] = "Бердск";
gorr[91] = "Березники";
gorr[92] = "Берёзовский";
gorr[93] = "Берёзовский";
gorr[94] = "Беслан";
gorr[95] = "Бийск";
gorr[96] = "Бикин";
gorr[97] = "Билибино";
gorr[98] = "Биробиджан";
gorr[99] = "Бирск";
gorr[100] = "Бирюсинск";
gorr[101] = "Бирюч";
gorr[102] = "Благовещенск";
gorr[103] = "Благовещенск";
gorr[104] = "Благодарный";
gorr[105] = "Бобров";
gorr[106] = "Богданович";
gorr[107] = "Богородицк";
gorr[108] = "Богородск";
gorr[109] = "Богородск";
gorr[110] = "Боготол";
gorr[111] = "Богучар";
gorr[112] = "Бодайбо";
gorr[113] = "Бокситогорск";
gorr[114] = "Болгар";
gorr[115] = "Бологое";
gorr[116] = "Болотное";
gorr[117] = "Болохово";
gorr[118] = "Болхов";
gorr[119] = "Большой Камень";
gorr[120] = "Бор";
gorr[121] = "Бор";
gorr[122] = "Борзя";
gorr[123] = "Борисоглебск";
gorr[124] = "Боровичи";
gorr[125] = "Боровск";
gorr[126] = "Бородино";
gorr[127] = "Братск";
gorr[128] = "Бронницы";
gorr[129] = "Брянск";
gorr[130] = "Бугульма";
gorr[131] = "Бугуруслан";
gorr[132] = "Будённовск";
gorr[133] = "Бузулук";
gorr[134] = "Буинск";
gorr[135] = "Буй";
gorr[136] = "Буйнакск";
gorr[137] = "Бутурлиновка";
gorr[138] = "Валдай";
gorr[139] = "Валуйки";
gorr[140] = "Велиж";
gorr[141] = "Великие Луки";
gorr[142] = "Великий Новгород";
gorr[143] = "Великий Устюг";
gorr[144] = "Вельск";
gorr[145] = "Венёв";
gorr[146] = "Верещагино";
gorr[147] = "Верея";
gorr[148] = "Верхнеуральск";
gorr[149] = "Верхний Тагил";
gorr[150] = "Верхний Уфалей";
gorr[151] = "Верхняя Пышма";
gorr[152] = "Верхняя Салда";
gorr[153] = "Верхняя Тура";
gorr[154] = "Верхотурье";
gorr[155] = "Верхоянск";
gorr[156] = "Весьегонск";
gorr[157] = "Ветлуга";
gorr[158] = "Ветлуга";
gorr[159] = "Видное";
gorr[160] = "Вилюйск";
gorr[161] = "Вилючинск";
gorr[162] = "Вихоревка";
gorr[163] = "Вичуга";
gorr[164] = "Владивосток";
gorr[165] = "Владикавказ";
gorr[166] = "Владимир";
gorr[167] = "Волгоград";
gorr[168] = "Волгодонск";
gorr[169] = "Волгореченск";
gorr[170] = "Волжск";
gorr[171] = "Волжский";
gorr[172] = "Вологда";
gorr[173] = "Володарск";
gorr[174] = "Володарск";
gorr[175] = "Волоколамск";
gorr[176] = "Волосово";
gorr[177] = "Волхов";
gorr[178] = "Волчанск";
gorr[179] = "Вольск";
gorr[180] = "Воркута";
gorr[181] = "Воронеж";
gorr[182] = "Ворсма";
gorr[183] = "Ворсма";
gorr[184] = "Воскресенск";
gorr[185] = "Воткинск";
gorr[186] = "Всеволожск";
gorr[187] = "Вуктыл";
gorr[188] = "Выборг";
gorr[189] = "Выкса";
gorr[190] = "Выкса";
gorr[191] = "Высоковск";
gorr[192] = "Высоцк";
gorr[193] = "Вытегра";
gorr[194] = "Вышний Волочёк";
gorr[195] = "Вяземский";
gorr[196] = "Вязники";
gorr[197] = "Вязьма";
gorr[198] = "Вятские Поляны";
gorr[199] = "Гаврилов Посад";
gorr[200] = "Гаврилов-Ям";
gorr[201] = "Гагарин";
gorr[202] = "Гаджиево";
gorr[203] = "Гай";
gorr[204] = "Галич";
gorr[205] = "Гатчина";
gorr[206] = "Гвардейск";
gorr[207] = "Гдов";
gorr[208] = "Геленджик";
gorr[209] = "Георгиевск";
gorr[210] = "Глазов";
gorr[211] = "Горбатов";
gorr[212] = "Горбатов";
gorr[213] = "Горно-Алтайск";
gorr[214] = "Горнозаводск";
gorr[215] = "Горнозаводск";
gorr[216] = "Горняк";
gorr[217] = "Городец";
gorr[218] = "Городец";
gorr[219] = "Городище";
gorr[220] = "Городовиковск";
gorr[221] = "Гороховец";
gorr[222] = "Горячий Ключ";
gorr[223] = "Грайворон";
gorr[224] = "Гремячинск";
gorr[225] = "Грозный";
gorr[226] = "Грязи";
gorr[227] = "Грязовец";
gorr[228] = "Губаха";
gorr[229] = "Губкин";
gorr[230] = "Губкинский";
gorr[231] = "Гудермес";
gorr[232] = "Гуково";
gorr[233] = "Гулькевичи";
gorr[234] = "Гурьевск";
gorr[235] = "Гурьевск";
gorr[236] = "Гусев";
gorr[237] = "Гусиноозёрск";
gorr[238] = "Гусь-Хрустальный";
gorr[239] = "Давлеканово";
gorr[240] = "Дагестанские Огни";
gorr[241] = "Далматово";
gorr[242] = "Дальнегорск";
gorr[243] = "Дальнереченск";
gorr[244] = "Данилов";
gorr[245] = "Данков";
gorr[246] = "Дегтярск";
gorr[247] = "Дедовск";
gorr[248] = "Демидов";
gorr[249] = "Дербент";
gorr[250] = "Десногорск";
gorr[251] = "Дзержинск";
gorr[252] = "Дзержинск";
gorr[253] = "Дзержинский";
gorr[254] = "Дивногорск";
gorr[255] = "Дигора";
gorr[256] = "Димитровград";
gorr[257] = "Дмитриев-Льговский";
gorr[258] = "Дмитров";
gorr[259] = "Дмитровск";
gorr[260] = "Дно";
gorr[261] = "Добрянка";
gorr[262] = "Долгопрудный";
gorr[263] = "Долинск";
gorr[264] = "Домодедово";
gorr[265] = "Донецк";
gorr[266] = "Донской";
gorr[267] = "Дорогобуж";
gorr[268] = "Дрезна";
gorr[269] = "Дубна";
gorr[270] = "Дубовка";
gorr[271] = "Дудинка";
gorr[272] = "Духовщина";
gorr[273] = "Дюртюли";
gorr[274] = "Дятьково";
gorr[275] = "Егорьевск";
gorr[276] = "Ейск";
gorr[277] = "Екатеринбург";
gorr[278] = "Елабуга";
gorr[279] = "Елец";
gorr[280] = "Елизово";
gorr[281] = "Ельня";
gorr[282] = "Еманжелинск";
gorr[283] = "Емва";
gorr[284] = "Енисейск";
gorr[285] = "Ермолино";
gorr[286] = "Ершов";
gorr[287] = "Ессентуки";
gorr[288] = "Ефремов";
gorr[289] = "Железноводск";
gorr[290] = "Железногорск";
gorr[291] = "Железногорск";
gorr[292] = "Железногорск-Илимский";
gorr[293] = "Железнодорожный";
gorr[294] = "Жердевка";
gorr[295] = "Жигулёвск";
gorr[296] = "Жиздра";
gorr[297] = "Жирновск";
gorr[298] = "Жуков";
gorr[299] = "Жуковка";
gorr[300] = "Жуковский";
gorr[301] = "Завитинск";
gorr[302] = "Заводоуковск";
gorr[303] = "Заволжск";
gorr[304] = "Заволжье";
gorr[305] = "Заволжье";
gorr[306] = "Задонск";
gorr[307] = "Заинск";
gorr[308] = "Закаменск";
gorr[309] = "Заозёрный";
gorr[310] = "Заозёрск";
gorr[311] = "Западная Двина";
gorr[312] = "Заполярный";
gorr[313] = "Зарайск";
gorr[314] = "Заречный";
gorr[315] = "Заречный";
gorr[316] = "Заринск";
gorr[317] = "Звенигово";
gorr[318] = "Звенигород";
gorr[319] = "Зверево";
gorr[320] = "Зеленогорск";
gorr[321] = "Зеленоградск";
gorr[322] = "Зеленодольск";
gorr[323] = "Зеленокумск";
gorr[324] = "Зерноград";
gorr[325] = "Зея";
gorr[326] = "Зима";
gorr[327] = "Златоуст";
gorr[328] = "Злынка";
gorr[329] = "Змеиногорск";
gorr[330] = "Знаменск";
gorr[331] = "Зубцов";
gorr[332] = "Зуевка";
gorr[333] = "Ивангород";
gorr[334] = "Иваново";
gorr[335] = "Ивантеевка";
gorr[336] = "Ивдель";
gorr[337] = "Игарка";
gorr[338] = "Ижевск";
gorr[339] = "Избербаш";
gorr[340] = "Изобильный";
gorr[341] = "Иланский";
gorr[342] = "Инза";
gorr[343] = "Инсар";
gorr[344] = "Инта";
gorr[345] = "Ипатово";
gorr[346] = "Ирбит";
gorr[347] = "Иркутск";
gorr[348] = "Исилькуль";
gorr[349] = "Искитим";
gorr[350] = "Истра";
gorr[351] = "Ишим";
gorr[352] = "Ишимбай";
gorr[353] = "Йошкар-Ола";
gorr[354] = "Кадников";
gorr[355] = "Казань";
gorr[356] = "Калач";
gorr[357] = "Калачинск";
gorr[358] = "Калач-на-Дону";
gorr[359] = "Калининград";
gorr[360] = "Калининск";
gorr[361] = "Калтан";
gorr[362] = "Калуга";
gorr[363] = "Калязин";
gorr[364] = "Камбарка";
gorr[365] = "Каменка";
gorr[366] = "Каменногорск";
gorr[367] = "Каменск-Уральский";
gorr[368] = "Каменск-Шахтинский";
gorr[369] = "Камень-на-Оби";
gorr[370] = "Камешково";
gorr[371] = "Камызяк";
gorr[372] = "Камышин";
gorr[373] = "Камышлов";
gorr[374] = "Канаш";
gorr[375] = "Кандалакша";
gorr[376] = "Канск";
gorr[377] = "Карабаново";
gorr[378] = "Карабаш";
gorr[379] = "Карабулак";
gorr[380] = "Карасук";
gorr[381] = "Карачаевск";
gorr[382] = "Карачев";
gorr[383] = "Каргат";
gorr[384] = "Каргополь";
gorr[385] = "Карпинск";
gorr[386] = "Карталы";
gorr[387] = "Касимов";
gorr[388] = "Касли";
gorr[389] = "Каспийск";
gorr[390] = "Катав-Ивановск";
gorr[391] = "Катайск";
gorr[392] = "Качканар";
gorr[393] = "Кашин";
gorr[394] = "Кашира";
gorr[395] = "Кедровый";
gorr[396] = "Кемерово";
gorr[397] = "Кемь";
gorr[398] = "Кизел";
gorr[399] = "Кизилюрт";
gorr[400] = "Кизляр";
gorr[401] = "Кимовск";
gorr[402] = "Кимры";
gorr[403] = "Кингисепп";
gorr[404] = "Кинель";
gorr[405] = "Кинешма";
gorr[406] = "Киреевск";
gorr[407] = "Киренск";
gorr[408] = "Киржач";
gorr[409] = "Кириллов";
gorr[410] = "Кириши";
gorr[411] = "Киров";
gorr[412] = "Киров";
gorr[413] = "Кировград";
gorr[414] = "Кирово-Чепецк";
gorr[415] = "Кировск";
gorr[416] = "Кировск";
gorr[417] = "Кирс";
gorr[418] = "Кирсанов";
gorr[419] = "Киселёвск";
gorr[420] = "Кисловодск";
gorr[421] = "Климовск";
gorr[422] = "Клин";
gorr[423] = "Клинцы";
gorr[424] = "Княгинино";
gorr[425] = "Княгинино";
gorr[426] = "Ковдор";
gorr[427] = "Ковров";
gorr[428] = "Ковылкино";
gorr[429] = "Когалым";
gorr[430] = "Кодинск";
gorr[431] = "Козельск";
gorr[432] = "Козловка";
gorr[433] = "Козьмодемьянск";
gorr[434] = "Кола";
gorr[435] = "Кологрив";
gorr[436] = "Коломна";
gorr[437] = "Колпашево";
gorr[438] = "Кольчугино";
gorr[439] = "Коммунар";
gorr[440] = "Комсомольск";
gorr[441] = "Комсомольск-на-Амуре";
gorr[442] = "Конаково";
gorr[443] = "Кондопога";
gorr[444] = "Кондрово";
gorr[445] = "Константиновск";
gorr[446] = "Копейск";
gorr[447] = "Кораблино";
gorr[448] = "Кореновск";
gorr[449] = "Коркино";
gorr[450] = "Королёв";
gorr[451] = "Короча";
gorr[452] = "Корсаков";
gorr[453] = "Коряжма";
gorr[454] = "Костерево";
gorr[455] = "Костомукша";
gorr[456] = "Кострома";
gorr[457] = "Котельниково";
gorr[458] = "Котельнич";
gorr[459] = "Котлас";
gorr[460] = "Котово";
gorr[461] = "Котовск";
gorr[462] = "Кохма";
gorr[463] = "Красавино";
gorr[464] = "Красноармейск";
gorr[465] = "Красноармейск";
gorr[466] = "Красновишерск";
gorr[467] = "Красногорск";
gorr[468] = "Краснодар";
gorr[469] = "Краснозаводск";
gorr[470] = "Краснознаменск";
gorr[471] = "Краснознаменск";
gorr[472] = "Краснокаменск";
gorr[473] = "Краснокамск";
gorr[474] = "Краснослободск";
gorr[475] = "Краснослободск";
gorr[476] = "Краснотурьинск";
gorr[477] = "Красноуральск";
gorr[478] = "Красноуфимск";
gorr[479] = "Красноярск";
gorr[480] = "Красный Кут";
gorr[481] = "Красный Сулин";
gorr[482] = "Красный Холм";
gorr[483] = "Кремёнки";
gorr[484] = "Кропоткин";
gorr[485] = "Крымск";
gorr[486] = "Кстово";
gorr[487] = "Кстово";
gorr[488] = "Кувандык";
gorr[489] = "Кувшиново";
gorr[490] = "Кудымкар";
gorr[491] = "Кузнецк";
gorr[492] = "Куйбышев";
gorr[493] = "Кулебаки";
gorr[494] = "Кулебаки";
gorr[495] = "Кумертау";
gorr[496] = "Кунгур";
gorr[497] = "Купино";
gorr[498] = "Курган";
gorr[499] = "Курганинск";
gorr[500] = "Курильск";
gorr[501] = "Курлово";
gorr[502] = "Куровское";
gorr[503] = "Курск";
gorr[504] = "Куртамыш";
gorr[505] = "Курчатов";
gorr[506] = "Куса";
gorr[507] = "Кушва";
gorr[508] = "Кызыл";
gorr[509] = "Кыштым";
gorr[510] = "Кяхта";
gorr[511] = "Лабинск";
gorr[512] = "Лабытнанги";
gorr[513] = "Лагань";
gorr[514] = "Ладушкин";
gorr[515] = "Лакинск";
gorr[516] = "Лангепас";
gorr[517] = "Лахденпохья";
gorr[518] = "Лебедянь";
gorr[519] = "Лениногорск";
gorr[520] = "Ленинск";
gorr[521] = "Ленинск-Кузнецкий";
gorr[522] = "Ленск";
gorr[523] = "Лермонтов";
gorr[524] = "Лесной";
gorr[525] = "Лесозаводск";
gorr[526] = "Лесосибирск";
gorr[527] = "Ливны";
gorr[528] = "Ликино-Дулёво";
gorr[529] = "Липецк";
gorr[530] = "Липки";
gorr[531] = "Лиски";
gorr[532] = "Лихославль";
gorr[533] = "Лобня";
gorr[534] = "Лодейное Поле";
gorr[535] = "Лосино-Петровский";
gorr[536] = "Луга";
gorr[537] = "Луза";
gorr[538] = "Лукоянов";
gorr[539] = "Лукоянов";
gorr[540] = "Луховицы";
gorr[541] = "Лысково";
gorr[542] = "Лысково";
gorr[543] = "Лысьва";
gorr[544] = "Лыткарино";
gorr[545] = "Льгов";
gorr[546] = "Любань";
gorr[547] = "Люберцы";
gorr[548] = "Любим";
gorr[549] = "Людиново";
gorr[550] = "Лянтор";
gorr[551] = "Магадан";
gorr[552] = "Магас";
gorr[553] = "Магнитогорск";
gorr[554] = "Майкоп";
gorr[555] = "Майский";
gorr[556] = "Макаров";
gorr[557] = "Макарьев";
gorr[558] = "Макушино";
gorr[559] = "Малая Вишера";
gorr[560] = "Малгобек";
gorr[561] = "Малмыж";
gorr[562] = "Малоархангельск";
gorr[563] = "Малоярославец";
gorr[564] = "Мамадыш";
gorr[565] = "Мамоново";
gorr[566] = "Мантурово";
gorr[567] = "Мариинск";
gorr[568] = "Мариинский Посад";
gorr[569] = "Маркс";
gorr[570] = "Махачкала";
gorr[571] = "Мглин";
gorr[572] = "Мегион";
gorr[573] = "Медвежьегорск";
gorr[574] = "Медногорск";
gorr[575] = "Медынь";
gorr[576] = "Межгорье";
gorr[577] = "Междуреченск";
gorr[578] = "Мезень";
gorr[579] = "Меленки";
gorr[580] = "Мелеуз";
gorr[581] = "Менделеевск";
gorr[582] = "Мензелинск";
gorr[583] = "Мещовск";
gorr[584] = "Миасс";
gorr[585] = "Микунь";
gorr[586] = "Миллерово";
gorr[587] = "Минеральные Воды";
gorr[588] = "Минусинск";
gorr[589] = "Миньяр";
gorr[590] = "Мирный";
gorr[591] = "Мирный";
gorr[592] = "Михайлов";
gorr[593] = "Михайловка";
gorr[594] = "Михайловск";
gorr[595] = "Михайловск";
gorr[596] = "Мичуринск";
gorr[597] = "Могоча";
gorr[598] = "Можайск";
gorr[599] = "Можга";
gorr[600] = "Моздок";
gorr[601] = "Мончегорск";
gorr[602] = "Морозовск";
gorr[603] = "Моршанск";
gorr[604] = "Мосальск";
gorr[605] = "Москва";
gorr[606] = "Муравленко";
gorr[607] = "Мураши";
gorr[608] = "Мурманск";
gorr[609] = "Муром";
gorr[610] = "Мценск";
gorr[611] = "Мыски";
gorr[612] = "Мытищи";
gorr[613] = "Мышкин";
gorr[614] = "Набережные Челны";
gorr[615] = "Навашино";
gorr[616] = "Навашино";
gorr[617] = "Наволоки";
gorr[618] = "Надым";
gorr[619] = "Назарово";
gorr[620] = "Назрань";
gorr[621] = "Называевск";
gorr[622] = "Нальчик";
gorr[623] = "Нариманов";
gorr[624] = "Наро-Фоминск";
gorr[625] = "Нарткала";
gorr[626] = "Нарьян-Мар";
gorr[627] = "Находка";
gorr[628] = "Невель";
gorr[629] = "Невельск";
gorr[630] = "Невинномысск";
gorr[631] = "Невьянск";
gorr[632] = "Нелидово";
gorr[633] = "Неман";
gorr[634] = "Нерехта";
gorr[635] = "Нерчинск";
gorr[636] = "Нерюнгри";
gorr[637] = "Нестеров";
gorr[638] = "Нефтегорск";
gorr[639] = "Нефтекамск";
gorr[640] = "Нефтекумск";
gorr[641] = "Нефтеюганск";
gorr[642] = "Нея";
gorr[643] = "Нижневартовск";
gorr[644] = "Нижнекамск";
gorr[645] = "Нижнеудинск";
gorr[646] = "Нижние Серги";
gorr[647] = "Нижний Ломов";
gorr[648] = "Нижний Новгород";
gorr[649] = "Нижний Новгород";
gorr[650] = "Нижний Тагил";
gorr[651] = "Нижняя Салда";
gorr[652] = "Нижняя Тура";
gorr[653] = "Николаевск";
gorr[654] = "Николаевск-на-Амуре";
gorr[655] = "Никольск";
gorr[656] = "Никольск";
gorr[657] = "Никольское";
gorr[658] = "Новая Ладога";
gorr[659] = "Новая Ляля";
gorr[660] = "Новоалександровск";
gorr[661] = "Новоалтайск";
gorr[662] = "Новоаннинский";
gorr[663] = "Нововоронеж";
gorr[664] = "Новодвинск";
gorr[665] = "Новозыбков";
gorr[666] = "Новокубанск";
gorr[667] = "Новокузнецк";
gorr[668] = "Новокуйбышевск";
gorr[669] = "Новомичуринск";
gorr[670] = "Новомосковск";
gorr[671] = "Новопавловск";
gorr[672] = "Новоржев";
gorr[673] = "Новороссийск";
gorr[674] = "Новосибирск";
gorr[675] = "Новосиль";
gorr[676] = "Новосокольники";
gorr[677] = "Новотроицк";
gorr[678] = "Новоузенск";
gorr[679] = "Новоульяновск";
gorr[680] = "Новоуральск";
gorr[681] = "Новохоперск";
gorr[682] = "Новочебоксарск";
gorr[683] = "Новочеркасск";
gorr[684] = "Новошахтинск";
gorr[685] = "Новый Оскол";
gorr[686] = "Новый Уренгой";
gorr[687] = "Ногинск";
gorr[688] = "Нолинск";
gorr[689] = "Норильск";
gorr[690] = "Ноябрьск";
gorr[691] = "Нурлат";
gorr[692] = "Нытва";
gorr[693] = "Нюрба";
gorr[694] = "Нягань";
gorr[695] = "Нязепетровск";
gorr[696] = "Няндома";
gorr[697] = "Облучье";
gorr[698] = "Обнинск";
gorr[699] = "Обоянь";
gorr[700] = "Обь";
gorr[701] = "Одинцово";
gorr[702] = "Ожерелье";
gorr[703] = "Озёрск";
gorr[704] = "Озёрск";
gorr[705] = "Озёры";
gorr[706] = "Октябрьск";
gorr[707] = "Октябрьский";
gorr[708] = "Окуловка";
gorr[709] = "Олёкминск";
gorr[710] = "Оленегорск";
gorr[711] = "Олонец";
gorr[712] = "Омск";
gorr[713] = "Омутнинск";
gorr[714] = "Онега";
gorr[715] = "Опочка";
gorr[716] = "Орёл";
gorr[717] = "Оренбург";
gorr[718] = "Орехово-Зуево";
gorr[719] = "Орлов";
gorr[720] = "Орск";
gorr[721] = "Оса";
gorr[722] = "Осинники";
gorr[723] = "Осташков";
gorr[724] = "Остров";
gorr[725] = "Островной";
gorr[726] = "Острогожск";
gorr[727] = "Отрадное";
gorr[728] = "Отрадный";
gorr[729] = "Оха";
gorr[730] = "Оханск";
gorr[731] = "Очёр";
gorr[732] = "Павлово";
gorr[733] = "Павлово";
gorr[734] = "Павловск";
gorr[735] = "Павловский Посад";
gorr[736] = "Палласовка";
gorr[737] = "Партизанск";
gorr[738] = "Певек";
gorr[739] = "Пенза";
gorr[740] = "Первомайск";
gorr[741] = "Первомайск";
gorr[742] = "Первоуральск";
gorr[743] = "Перевоз";
gorr[744] = "Перевоз";
gorr[745] = "Пересвет";
gorr[746] = "Переславль-Залесский";
gorr[747] = "Пермь";
gorr[748] = "Пестово";
gorr[749] = "Петров Вал";
gorr[750] = "Петровск";
gorr[751] = "Петровск-Забайкальский";
gorr[752] = "Петрозаводск";
gorr[753] = "Петропавловск-Камчатский";
gorr[754] = "Петухово";
gorr[755] = "Петушки";
gorr[756] = "Печора";
gorr[757] = "Печоры";
gorr[758] = "Пикалёво";
gorr[759] = "Пионерский";
gorr[760] = "Питкяранта";
gorr[761] = "Плавск";
gorr[762] = "Пласт";
gorr[763] = "Плёс";
gorr[764] = "Поворино";
gorr[765] = "Подольск";
gorr[766] = "Подпорожье";
gorr[767] = "Покачи";
gorr[768] = "Покров";
gorr[769] = "Покровск";
gorr[770] = "Полевской";
gorr[771] = "Полесск";
gorr[772] = "Полысаево";
gorr[773] = "Полярные Зори";
gorr[774] = "Полярный";
gorr[775] = "Поронайск";
gorr[776] = "Порхов";
gorr[777] = "Похвистнево";
gorr[778] = "Почеп";
gorr[779] = "Починок";
gorr[780] = "Пошехонье";
gorr[781] = "Правдинск";
gorr[782] = "Приволжск";
gorr[783] = "Приморск";
gorr[784] = "Приморско-Ахтарск";
gorr[785] = "Приозерск";
gorr[786] = "Прокопьевск";
gorr[787] = "Пролетарск";
gorr[788] = "Протвино";
gorr[789] = "Прохладный";
gorr[790] = "Псков";
gorr[791] = "Пугачёв";
gorr[792] = "Пудож";
gorr[793] = "Пустошка";
gorr[794] = "Пучеж";
gorr[795] = "Пушкино";
gorr[796] = "Пущино";
gorr[797] = "Пыталово";
gorr[798] = "Пыть-Ях";
gorr[799] = "Пятигорск";
gorr[800] = "Радужный";
gorr[801] = "Радужный";
gorr[802] = "Райчихинск";
gorr[803] = "Раменское";
gorr[804] = "Рассказово";
gorr[805] = "Ревда";
gorr[806] = "Реж";
gorr[807] = "Реутов";
gorr[808] = "Ржев";
gorr[809] = "Родники";
gorr[810] = "Рославль";
gorr[811] = "Россошь";
gorr[812] = "Ростов Великий";
gorr[813] = "Ростов-на-Дону";
gorr[814] = "Рошаль";
gorr[815] = "Ртищево";
gorr[816] = "Рубцовск";
gorr[817] = "Рудня";
gorr[818] = "Руза";
gorr[819] = "Рузаевка";
gorr[820] = "Рыбинск";
gorr[821] = "Рыбное";
gorr[822] = "Рыльск";
gorr[823] = "Ряжск";
gorr[824] = "Рязань";
gorr[825] = "Салават";
gorr[826] = "Салаир";
gorr[827] = "Салехард";
gorr[828] = "Сальск";
gorr[829] = "Самара";
gorr[830] = "Санкт-Петербург";
gorr[831] = "Саранск";
gorr[832] = "Сарапул";
gorr[833] = "Саратов";
gorr[834] = "Саров";
gorr[835] = "Саров";
gorr[836] = "Сасово";
gorr[837] = "Сатка";
gorr[838] = "Сафоново";
gorr[839] = "Саяногорск";
gorr[840] = "Саянск";
gorr[841] = "Светлогорск";
gorr[842] = "Светлоград";
gorr[843] = "Светлый";
gorr[844] = "Светогорск";
gorr[845] = "Свирск";
gorr[846] = "Свободный";
gorr[847] = "Себеж";
gorr[848] = "Северобайкальск";
gorr[849] = "Северодвинск";
gorr[850] = "Северо-Курильск";
gorr[851] = "Североморск";
gorr[852] = "Североуральск";
gorr[853] = "Северск";
gorr[854] = "Севск";
gorr[855] = "Сегежа";
gorr[856] = "Сельцо";
gorr[857] = "Семёнов";
gorr[858] = "Семёнов";
gorr[859] = "Семикаракорск";
gorr[860] = "Семилуки";
gorr[861] = "Сенгилей";
gorr[862] = "Серафимович";
gorr[863] = "Сергач";
gorr[864] = "Сергач";
gorr[865] = "Сергиев Посад";
gorr[866] = "Сердобск";
gorr[867] = "Серов";
gorr[868] = "Серпухов";
gorr[869] = "Сертолово";
gorr[870] = "Сибай";
gorr[871] = "Сим";
gorr[872] = "Сковородино";
gorr[873] = "Скопин";
gorr[874] = "Славгород";
gorr[875] = "Славск";
gorr[876] = "Славянск-на-Кубани";
gorr[877] = "Сланцы";
gorr[878] = "Слободской";
gorr[879] = "Слюдянка";
gorr[880] = "Смоленск";
gorr[881] = "Снежинск";
gorr[882] = "Снежногорск";
gorr[883] = "Собинка";
gorr[884] = "Советск";
gorr[885] = "Советск";
gorr[886] = "Советск";
gorr[887] = "Советская Гавань";
gorr[888] = "Советский";
gorr[889] = "Сокол";
gorr[890] = "Солигалич";
gorr[891] = "Соликамск";
gorr[892] = "Солнечногорск";
gorr[893] = "Сольвычегодск";
gorr[894] = "Соль-Илецк";
gorr[895] = "Сольцы";
gorr[896] = "Сорочинск";
gorr[897] = "Сорск";
gorr[898] = "Сортавала";
gorr[899] = "Сосенский";
gorr[900] = "Сосновка";
gorr[901] = "Сосновоборск";
gorr[902] = "Сосновый Бор";
gorr[903] = "Сосногорск";
gorr[904] = "Сочи";
gorr[905] = "Спас-Деменск";
gorr[906] = "Спас-Клепики";
gorr[907] = "Спасск";
gorr[908] = "Спасск-Дальний";
gorr[909] = "Спасск-Рязанский";
gorr[910] = "Среднеколымск";
gorr[911] = "Среднеуральск";
gorr[912] = "Сретенск";
gorr[913] = "Ставрополь";
gorr[914] = "Старая Русса";
gorr[915] = "Старица";
gorr[916] = "Стародуб";
gorr[917] = "Старый Оскол";
gorr[918] = "Стерлитамак";
gorr[919] = "Стрежевой";
gorr[920] = "Строитель";
gorr[921] = "Струнино";
gorr[922] = "Ступино";
gorr[923] = "Суворов";
gorr[924] = "Суджа";
gorr[925] = "Судогда";
gorr[926] = "Суздаль";
gorr[927] = "Суоярви";
gorr[928] = "Сураж";
gorr[929] = "Сургут";
gorr[930] = "Суровикино";
gorr[931] = "Сурск";
gorr[932] = "Сусуман";
gorr[933] = "Сухиничи";
gorr[934] = "Сухой Лог";
gorr[935] = "Сходня";
gorr[936] = "Сызрань";
gorr[937] = "Сыктывкар";
gorr[938] = "Сысерть";
gorr[939] = "Сычевка";
gorr[940] = "Сясьстрой";
gorr[941] = "Тавда";
gorr[942] = "Таганрог";
gorr[943] = "Тайга";
gorr[944] = "Тайшет";
gorr[945] = "Талдом";
gorr[946] = "Талица";
gorr[947] = "Тамбов";
gorr[948] = "Тара";
gorr[949] = "Таруса";
gorr[950] = "Татарск";
gorr[951] = "Таштагол";
gorr[952] = "Тверь";
gorr[953] = "Теберда";
gorr[954] = "Тейково";
gorr[955] = "Темников";
gorr[956] = "Темрюк";
gorr[957] = "Терек";
gorr[958] = "Тетюши";
gorr[959] = "Тимашевск";
gorr[960] = "Тихвин";
gorr[961] = "Тихорецк";
gorr[962] = "Тобольск";
gorr[963] = "Тогучин";
gorr[964] = "Тольятти";
gorr[965] = "Томари";
gorr[966] = "Томмот";
gorr[967] = "Томск";
gorr[968] = "Топки";
gorr[969] = "Торжок";
gorr[970] = "Торопец";
gorr[971] = "Тосно";
gorr[972] = "Тотьма";
gorr[973] = "Трехгорный";
gorr[974] = "Троицк";
gorr[975] = "Троицк";
gorr[976] = "Трубчевск";
gorr[977] = "Туапсе";
gorr[978] = "Туймазы";
gorr[979] = "Тула";
gorr[980] = "Тулун";
gorr[981] = "Туран";
gorr[982] = "Туринск";
gorr[983] = "Тутаев";
gorr[984] = "Тында";
gorr[985] = "Тырныауз";
gorr[986] = "Тюкалинск";
gorr[987] = "Тюмень";
gorr[988] = "Уварово";
gorr[989] = "Углегорск";
gorr[990] = "Углич";
gorr[991] = "Удачный";
gorr[992] = "Удомля";
gorr[993] = "Ужур";
gorr[994] = "Узловая";
gorr[995] = "Улан-Удэ";
gorr[996] = "Ульяновск";
gorr[997] = "Унеча";
gorr[998] = "Урай";
gorr[999] = "Урень";
gorr[1000] = "Урень";
gorr[1001] = "Уржум";
gorr[1002] = "Урус-Мартан";
gorr[1003] = "Урюпинск";
gorr[1004] = "Усинск";
gorr[1005] = "Усмань";
gorr[1006] = "Усолье";
gorr[1007] = "Усолье-Сибирское";
gorr[1008] = "Уссурийск";
gorr[1009] = "Усть-Джегута";
gorr[1010] = "Усть-Илимск";
gorr[1011] = "Усть-Катав";
gorr[1012] = "Усть-Кут";
gorr[1013] = "Усть-Лабинск";
gorr[1014] = "Устюжна";
gorr[1015] = "Уфа";
gorr[1016] = "Ухта";
gorr[1017] = "Учалы";
gorr[1018] = "Уяр";
gorr[1019] = "Фатеж";
gorr[1020] = "Фокино";
gorr[1021] = "Фокино";
gorr[1022] = "Фролово";
gorr[1023] = "Фрязино";
gorr[1024] = "Фурманов";
gorr[1025] = "Хабаровск";
gorr[1026] = "Хадыженск";
gorr[1027] = "Ханты-Мансийск";
gorr[1028] = "Харабали";
gorr[1029] = "Харовск";
gorr[1030] = "Хасавюрт";
gorr[1031] = "Хвалынск";
gorr[1032] = "Хилок";
gorr[1033] = "Химки";
gorr[1034] = "Холм";
gorr[1035] = "Холмск";
gorr[1036] = "Хотьково";
gorr[1037] = "Цивильск";
gorr[1038] = "Цимлянск";
gorr[1039] = "Чадан";
gorr[1040] = "Чайковский";
gorr[1041] = "Чапаевск";
gorr[1042] = "Чаплыгин";
gorr[1043] = "Чебаркуль";
gorr[1044] = "Чебоксары";
gorr[1045] = "Чегем";
gorr[1046] = "Чекалин";
gorr[1047] = "Челябинск";
gorr[1048] = "Чердынь";
gorr[1049] = "Черемхово";
gorr[1050] = "Черепаново";
gorr[1051] = "Череповец";
gorr[1052] = "Черкесск";
gorr[1053] = "Чёрмоз";
gorr[1054] = "Черноголовка";
gorr[1055] = "Черногорск";
gorr[1056] = "Чернушка";
gorr[1057] = "Черняховск";
gorr[1058] = "Чехов";
gorr[1059] = "Чистополь";
gorr[1060] = "Чита";
gorr[1061] = "Чкаловск";
gorr[1062] = "Чкаловск";
gorr[1063] = "Чудово";
gorr[1064] = "Чулым";
gorr[1065] = "Чусовой";
gorr[1066] = "Чухлома";
gorr[1067] = "Шагонар";
gorr[1068] = "Шадринск";
gorr[1069] = "Шали";
gorr[1070] = "Шарыпово";
gorr[1071] = "Шарья";
gorr[1072] = "Шатура";
gorr[1073] = "Шахтёрск";
gorr[1074] = "Шахты";
gorr[1075] = "Шахунья";
gorr[1076] = "Шахунья";
gorr[1077] = "Шацк";
gorr[1078] = "Шебекино";
gorr[1079] = "Шелехов";
gorr[1080] = "Шенкурск";
gorr[1081] = "Шилка";
gorr[1082] = "Шимановск";
gorr[1083] = "Шиханы";
gorr[1084] = "Шлиссельбург";
gorr[1085] = "Шумерля";
gorr[1086] = "Шумиха";
gorr[1087] = "Шуя";
gorr[1088] = "Щёкино";
gorr[1089] = "Щёлково";
gorr[1090] = "Щербинка";
gorr[1091] = "Щигры";
gorr[1092] = "Щучье";
gorr[1093] = "Электрогорск";
gorr[1094] = "Электросталь";
gorr[1095] = "Электроугли";
gorr[1096] = "Элиста";
gorr[1097] = "Энгельс";
gorr[1098] = "Эртиль";
gorr[1099] = "Юбилейный";
gorr[1100] = "Югорск";
gorr[1101] = "Южа";
gorr[1102] = "Южно-Сахалинск";
gorr[1103] = "Южно-Сухокумск";
gorr[1104] = "Южноуральск";
gorr[1105] = "Юрга";
gorr[1106] = "Юрьевец";
gorr[1107] = "Юрьев-Польский";
gorr[1108] = "Юрюзань";
gorr[1109] = "Юхнов";
gorr[1110] = "Ядрин";
gorr[1111] = "Якутск";
gorr[1112] = "Ялуторовск";
gorr[1113] = "Янаул";
gorr[1114] = "Яранск";
gorr[1115] = "Яровое";
gorr[1116] = "Ярославль";
gorr[1117] = "Ярцево";
gorr[1118] = "Ясногорск";
gorr[1119] = "Ясный";
gorr[1120] = "Яхрома";
gorr[1121] = "Колпино";
gorr[1122] = "Красное село";
gorr[1123] = "Кронштадт";
gorr[1124] = "Петергоф";


$(document).ready(function () {
$('.num_sotr_div').hide();
$('.num_mag_div').hide();

	var maxHeight = 0;

$("ul.checksotr li").each(function(){
  if ( $(this).height() > maxHeight )
  {
    maxHeight = $(this).height();
  }
});

$("ul.checksotr li").height(maxHeight);



	$('ul.checksotr li').click(function(){
	$('ul.checksotr li').removeClass('active');
	$(this).addClass('active');
	if($(this).hasClass('sotr')){
		$('.num_sotr_div').slideDown("slow");
		$('.num_mag_div').slideDown("slow");
	}
	else
	{
		check13 = true;
        check12 = true;

        $('.num_sotr_div').slideUp(300);
		$('.num_mag_div').slideUp(300);
		}

});


    $('#cardnumber').focusout(function () {
        var card_num = $(this).val();
        

    });

 //    $('.options li').on("click touchstart", function () {
 //        if ($(this).parent().siblings().attr('id') == 'region_id') {
 //            $.ajax(
 //                {
 //                    url: "/registraciya_karty/get_region_cities.php",
 //                    dataType: "text",
 //                    data: {'region_id': $(this).data('raw-value'), 'type': 'option'},
 //                    type: "post",
 //                    success: function (ans) {
 //                        $('#city').html(ans);
 //                        $('#city').trigger('update.fs');
 //                    }
 //                });
 //        }
 //    });
	// $("#region_id").fancySelect().on('change.fs', function () {
 //    	$.ajax(
	//         {
	//             url: "/registraciya_karty/get_region_cities.php",
	//             dataType: "text",
	//             data: {'region_id': this.value, 'type': 'option'},
	//             type: "post",
	//             success: function (ans) {
	//                 $('#city').html(ans);
	//                 $('#city').trigger('update.fs');
	//                 console.log(ans);
	//             }
	//         });
	// });
    $("#surname").keyup(function () {
        
        if ($(this).val().indexOf('-') == -1) {
            this.value = this.value.replace(/[^а-яё-]/i, "");
            length = $(this).val().length;
            first_part = $(this).val();
        } else {
            if (first_part.indexOf('-') == -1) {
                first_part = first_part + '-';
            }
            this.value = first_part + this.value.substring(length + 1, this.value.length).replace(/[^а-яё]/i, "");
        }

    });
    $("#name").keyup(function () {
        this.value = this.value.replace(/[^а-яё ]/i, "");
    });


    $("#patronymic").keyup(function () {
        this.value = this.value.replace(/[^а-яё]/i, "");
    });
    $("#doc_seria").keyup(function () {
        this.value = this.value.replace(/[^0-9]/i, "");
    });
    $("#doc_number").keyup(function () {
        this.value = this.value.replace(/[^0-9]/i, "");
    });


    function isKyr(str) {
        return /[а-яё]/i.test(str);
    }


    $('#surname').blur(function () {
        if ($(this).val() != '') {
            if ($(this).val().length >= 2) {
                if (isKyr($(this).val())) {
                    $(this).parent().find('span').text('');
                    $(this).css('border-color', 'green');
                    $(this).css('color', 'green');
                    check7 = true;
                } else {
                    $(this).css('border-color', 'red');
                    $(this).css('color', 'red');
                    $(this).parent().find('span').text('Поле Фамилия не должно содержать латинские символы');
                    $('.submit').addClass('pointer');
                    check7 = false;
                }
            } else {
                $(this).css('border-color', 'red');
                $(this).css('color', 'red');
                $(this).parent().find('span').text('Поле Фамилия должно быть длиннее');
                $('.submit').addClass('pointer');
                check7 = false;
            }
        } else {
            $(this).css('border-color', 'red');
            $(this).css('color', 'red');
            $(this).parent().find('span').text('Поле Фамилия не должно быть пустым');
            $('.submit').addClass('pointer');
            check7 = false;
        }
    });
     $('#city').blur(function () {
        if ($(this).val() != '') {
            if ($(this).val().length >= 2) {
                if (isKyr($(this).val())) {
                    $(this).parent().find('span').text('');
                    $(this).css('border-color', 'green');
                    $(this).css('color', 'green');
                    check14 = true;
                } else {
                    $(this).css('border-color', 'red');
                    $(this).css('color', 'red');
                    $(this).parent().find('span').text('Поле Город не должно содержать латинские символы');
                    $('.submit').addClass('pointer');
                    check14 = false;
                }
            } else {
                $(this).css('border-color', 'red');
                $(this).css('color', 'red');
                $(this).parent().find('span').text('Поле Город должно быть длиннее');
                $('.submit').addClass('pointer');
                check14 = false;
            }
        } else {
            $(this).css('border-color', 'red');
            $(this).css('color', 'red');
            $(this).parent().find('span').text('Поле Город не должно быть пустым');
            $('.submit').addClass('pointer');
            check14 = false;
        }
    });
    $('#name').blur(function () {
        if ($(this).val() != '') {
            if ($(this).val().length >= 2) {
                if (isKyr($(this).val())) {
                    $(this).parent().find('span').text('');
                    $(this).css('border-color', 'green');
                    $(this).css('color', 'green');
                    check1 = true;
                } else {
                    $(this).css('border-color', 'red');
                    $(this).css('color', 'red');
                    $(this).parent().find('span').text('Поле Имя не должно содержать латинские символы');
                    $('.submit').addClass('pointer');
                    check7 = false;
                }
            } else {
                $(this).css('border-color', 'red');
                $(this).css('color', 'red');
                $(this).parent().find('span').text('Поле Имя должно быть длиннее');
                $('.submit').addClass('pointer');
                check1 = false;
            }
        } else {
            $(this).css('border-color', 'red');
            $(this).css('color', 'red');
            $(this).parent().find('span').text('Поле Имя не должно быть пустым');
            $('.submit').addClass('pointer');
            check1 = false;
        }
    });


    // ecom-1143, не работало на планшетах
    // отключено навязчивое форматирование
    // ввода телефона по маске
   $('#phone').change(function () {
        // console.log($(this).val());
        var phone = $(this).val().length,
            phoneRegPattern = /^((8|\+7)[\- ]?)?(\(?\d{3,4}\)?[\- ]?)?[\d\- ]{5,10}$/;

        // if($(this).val().match(phoneRegPattern) === null) console.log('f');
        // console.log(phone);
        if ((phone < 11) || ($(this).val().match(phoneRegPattern) === null)) {
            $(this).css('border-color', 'red');
            $(this).parent().find('span').text('+79999999999');
            check4 = false;
        } else {
            check4 = true;
            $(this).css('border-color', '#888');
            $(this).parent().find('span').text('');
        }
    });


	$("#num_s").keyup(function () {
        this.value = this.value.replace(/[^0-9]/i, "");
    });
	$('#num_s').change(function () {
        
        var num_s = $(this).val().length;
        if (num_s < 4) {
            $(this).css('border-color', 'red');
            $(this).parent().find('span').text('Номер слишком короткий!');
            check12 = false;
        } else {
			$(this).css('border-color', 'green');
            $(this).parent().find('span').text('');
            check12 = true;
        }
    });
	if(!$('#num_mag_div').is(":visible"))
	{ check12 = true;}


	$("#nmag").keyup(function () {
        this.value = this.value.replace(/[^0-9]/i, "");
    });
	$('#nmag').change(function () {
        
        var nmag = $(this).val().length;
        if (nmag < 4) {
            $(this).css('border-color', 'red');
            $(this).parent().find('span').text('Номер слишком короткий!');
            check13 = false;
        } else {
			$(this).css('border-color', 'green');
            $(this).parent().find('span').text('');
            check13 = true;
        }
    });
	if(!$('#num_mag_div').is(":visible"))
	{ check13 = true;}

    $('#patronymic').blur(function () {
        
        if ($(this).val() != '') {
            if ($(this).val().length >= 2) {
                if (isKyr($(this).val())) {
                    $(this).parent().find('span').text('');
                    $(this).css('border-color', 'green');
                    $(this).css('color', 'green');
                    check5 = true;
                } else {
                    $(this).css('border-color', 'red');
                    $(this).css('color', 'red');
                    $(this).parent().find('span').text('Поле Отчество не должно содержать латинские символы');
                    $('.submit').addClass('pointer');
                    check7 = false;
                }
            } else {
                $(this).css('border-color', 'red');
                $(this).css('color', 'red');
                $(this).parent().find('span').text('Поле Отчество должно быть длиннее');
                $('.submit').addClass('pointer');
                check5 = false;
            }
        } else {
            $(this).css('border-color', 'red');
            $(this).css('color', 'red');
            $(this).parent().find('span').text('Поле Отчество не должно быть пустым');
            $('.submit').addClass('pointer');
            check5 = false;
        }
    });

// if (!$.browser.msie) {
    $('#birth_date').change(function () {
        var first_date = new Date(1914, 1, 1);
        var last_date = new Date(2003, 1, 1);
        var date = $(this).val().split('/');
        
        var new_date = new Date(date[2], date[1], date[0]);
        if ($(this).val() != '') {
            if (new_date >= first_date && new_date <= last_date) {
                //$(this).parent().find('span').text('');
                $(this).css('border-color', 'green');
                $(this).css('color', 'green');

                check6 = true;
            } else {
                $(this).css('border-color', 'red');
                $(this).css('color', 'red');
                // $(this).parent().find('span').text('Дата лежит в недопустимых границах');
                $('.submit').addClass('pointer');
                check6 = false;
                //errors.push('Неверная дата рождения');
            }
        }
    });

    setInterval(function () {
        if ($('#doc_name').val() != 0) {
            if ($('#doc_whom').val() != '' && $('#doc_seria').val() != '' && $('#doc_number').val() != '' && $('#doc_date').val() != '') {
                var first_date = new Date(1964, 1, 1);
                var last_date = new Date(2016, 04, 01);
                
                
                var date = $('#doc_date').val().split('/');
                
                var new_date = new Date(date[2], date[1], date[0]);
                if (new_date >= first_date && new_date <= last_date) {
                    check9 = true;
                    $('#doc_whom, #doc_seria, #doc_number, #doc_seria, #doc_date').css('border-color', 'green');
                    1233
                } else {
                    check9 = false;
                    $('#doc_whom, #doc_seria, #doc_number, #doc_seria, #doc_date').css('border-color', 'red');
                }
            } else {
                check9 = false;
                $('#doc_whom, #doc_seria, #doc_number, #doc_seria, #doc_date').css('border-color', 'red');
            }
        }
        //$('#city').selectbox('detach').selectbox('attach');
        //console.log($('#city').find('option:selected').val() + "qweee");
        // if ($('#city').val().length != 0) {
        //     $('#city').parent().find('span.error').text('');
        //     $('#city').css('border-color', 'green');
        //     $('#city').css('color', 'green');
        //     check2 = true;

        // } else {
        //     $('#city').css('border-color', 'red');
        //     $('#city').css('color', 'red');
        //     $('#city').parent().find('span.error').text('Поле город проживания не должно быть пустым');

        //     check2 = false;
        // }

        if ($('#gender').find('option:selected').val() != 0) {
            $('#gender').parent().find('span.error').text('');
            $('#gender').css('border-color', 'green');
            $('#gender').css('color', 'green');
            check3 = true;

        } else {
            $('#gender').css('border-color', 'red');
            $('#gender').css('color', 'red');
            $('#gender').parent().find('span.error').text('Поле Область проживания не должно быть пустым');

            check3 = false;
        }


      //  console.log(check1 + "|" + check2 + "|" + check3 + "|" + check4 + "|" + check5 + "|" + check6 + "|" + check7 + "|" + check8 + "|" + check9);
    }, 1000);

});